blog-repo-structure.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Web Blog Repository Structure</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href=" ./css/code.css" />
<link rel="stylesheet" href="./css/simple.css" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css" integrity="sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=" crossorigin="anonymous">
<link rel="shortcut icon" href="./img/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="content">
<h1 class="title">Web Blog Repository Structure</h1>
<hr>

<p>
In this note, I am explaining the structure of the repository I use to write notes and how everythong is set up. The blog is under version control with git which makes it easier to track all the changes and setup automations which will update the webserver with newly written content. The repo contains two branches, master and publish. Master tracks all the resources needed to build the website and publish contains the final product ready to host on a web server. 
</p>

<div id="outline-container-org619beb6" class="outline-2">
<h2 id="org619beb6">The Master Branch</h2>
<div class="outline-text-2" id="text-org619beb6">
<p>
This is the main branch of the project. The <a href="./publish-settings.html">build.org</a> contins all the publishing settings for the project. It only tracks the resources required, i.e .org, .css, .js files, and not the actual published html filed. The folder <code>public</code> is not tracked by this branch. Running <code>build.sh</code> publishes the project in this folder. All the notes which are needed to be published are kept in <code>content</code> folder. The folder <code>public/setup</code> contains org files with common settigs for all the other files. These org files are not published.  The folder <code>resources</code> contains all the shared css and js files. The <code>hooks</code> folder contains all of the automation scripts.
</p>
<pre class="example">
root                             # Master branch worktree
├── build.org                    # Build setup
├── build.sh                     # Publishing script
├── build.sh
├── content                      # Page content
│   ├── index.org
│   └── setup                    # General setup settings 
│       ├── footer.setup.org
│       ├── header.setup.org
│       └── theme.setup.org
├── hooks                        # Automation scripts
│   └── publish-on-commit
├── public                       # Untracked publish folder
│   ├── css
│   │   ├── code.css
│   │   └── simple.css
│   ├── img
│   ├── index.html
│   └── sitemap.html
└── resources                    # Version controlled general resources
    ├── css
    │   ├── code.css
    │   └── simple.css
    ├── js
    └── themes                   # Alternate stylings
        └── alt-theme.css
</pre>
</div>
</div>


<div id="outline-container-org8611287" class="outline-2">
<h2 id="org8611287">The Publish Branch</h2>
<div class="outline-text-2" id="text-org8611287">
<p>
This branch is the root of webserver. The worktree of this branch has all the contents of <code>public</code> folder obtained by building the project. As the web server do not need org files, only required files are tracked by this branch. In my case, I am using this branch to host static webpages with github pages. 
</p>
<pre class="example">
root                      # Publish branch worktree
 ├── css
 │   ├── code.css
 │   └── simple.css
 ├── img
 ├── index.html
 ├── other-pages.html
 └── sitemap.html
</pre>
</div>
</div>

<div id="outline-container-org726c6d1" class="outline-2">
<h2 id="org726c6d1">Publishing Steps</h2>
<div class="outline-text-2" id="text-org726c6d1">
<p>
Everytime I write a page or make changes to the project, I run the following steps.
</p>

<ol class="org-ol">
<li>Commit changes to the master branch.</li>
<li>Run <code>build.sh</code></li>
<li>Checkout publish branch</li>
<li>Remove all the old html files</li>
<li>Move contents of <code>publish</code> folder to the worktree</li>
<li>Commit changes to the publish branch</li>
<li>Push both master and publish to the remote</li>
</ol>

<p>
I am planning to create a post-commit hook which will automate the execution of steps 2-6. [see <a href="./git-hook-publish-pipeline.html">git hooks</a>].
</p>

<hr>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
<hr>
<p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#">
    <i class="fa fa-home fa-lg link-icon" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/">
    <i class="fa fa-instagram fa-lg link-icon" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo">
    <i class="fa fa-github fa-lg link-icon" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/'>
    <i class="fa fa-linkedin-square fa-lg link-icon" aria-hidden="true"></i>
  </a>
  <a href='#content'>
    <i class="fa fa-hand-o-up  fa-lg link-icon" aria-hidden="true"></i>
  </a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
